.text
lui $21,0x123#$21=0x01230000
lui $30,0xffff
lui $29,0x8000#$29=0x80000000
ori $17,$30,0xffff#$17=0xffffffff(-1)
lui $20,0x1234#$20=0x12340000
addu $20,$20,$21#20=0x13570000（正数+正数）
addu $31,$17,$20#$17=1356ffff(测试正数+负数)
sw $20,4($0)
subu $19,$20,$21#$19=0x12340000
addu $12,$17,$17#$12=-1+-1=-2
addu $18,$29,$29#overflow ,$18=0
sw $18,0($0)
nop
lw $16,4($0)#$16=0x13570000
subu $16,$16,$19#$16=0x01230000
beq $18,$0,label
nop
ori $15,$15,1#若$18!=0,则$15=1（这句不执行）
label:
beq $16,$21,next
ori $16,$16,1#$16不应该是0x01230001(跳过)
next:
lui $14,0x7fff
addu $15,$14,$14#正数加正数，会溢出0xfffe0000
beq $15,$14,end
ori $13,$13,1#$13结果应该是1
end:
